{"update_time": 1556848765, "tuner": {"name": "RandomSearch", "objective": "val_binary_accuracy", "start_time": 1556848755, "remaining_budget": 3, "eta": 10, "epoch_budget": 9, "max_epochs": 3, "min_epochs": 3, "project": "default", "architecture": "default", "user_info": {}, "num_executions": 1, "max_model_parameters": 25000000, "checkpoint": true, "dry_run": false, "debug": false, "display_model": false, "stats": {"num_generated_models": 2, "num_invalid_models": 0, "num_mdl_previously_trained": 0, "num_collision": 0, "num_over_sized_models": 0}, "host": {"result_dir": "results/", "tmp_dir": "tmp/", "export_dir": "export/", "cpu": {"name": "Intel64 Family 6 Model 158 Stepping 10, GenuineIntel", "core_count": 12, "usage": 20.2, "frequency": {"unit": "MHZ", "current": 3696.0, "max": 3696.0}}, "ram": {"unit": "MB", "used": 13882, "total": 65450}, "gpu": [{"memory": {"unit": "MB", "total": 11264, "used": 10518}, "temperature": {"unit": "C", "value": 58}, "index": "0", "name": "GeForce RTX 2080 Ti", "usage": "19", "uuid": "GPU-e883dd3c-e24c-249e-a7e1-00f9c6c149a0"}], "uptime": 988748, "disk": [{"name": "C:\\", "unit": "GB", "used": 697, "total": 953}, {"name": "D:\\", "unit": "GB", "used": 1642, "total": 1862}], "software": {"kerastuner": "0.8.2", "tensorflow": "1.13.1", "tensorflow_use_gpu": true, "python": "3.6.7rc1", "os": {"name": "Windows", "version": "10.0.17134"}, "gpu_driver": "419.35"}, "hostname": "Emerald", "available_gpu": 1}, "metrics": {}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5165656805038452, "last_value": 0.5165656805038452, "direction": "max", "history": [0.509797990322113, 0.510606050491333, 0.5112121105194092, 0.5112121105194092, 0.5112121105194092, 0.5165656805038452], "statistics": {"min": 0.509797990322113, "max": 0.5165656805038452, "mean": 0.5117676754792532, "median": 0.5112121105194092, "variance": 4.862640286774757e-06, "stddev": 0.00220513951639681}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055, 8.445248126983643]}, {"name": "loss", "best_value": 0.6925253461587308, "last_value": 0.6925253461587308, "direction": "min", "history": [0.7156840212899025, 0.700234091956206, 0.6960504973295963, 0.6960504973295963, 0.6960504973295963, 0.6925253461587308], "statistics": {"min": 0.6925253461587308, "max": 0.7156840212899025, "mean": 0.699432491898938, "median": 0.6960504973295963, "variance": 5.779618237913768e-05, "stddev": 0.007602380047007495}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055, 8.445248126983643]}, {"name": "val_binary_accuracy", "best_value": 0.550000011920929, "last_value": 0.550000011920929, "direction": "max", "history": [0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.550000011920929], "statistics": {"min": 0.49000000953674316, "max": 0.550000011920929, "mean": 0.5000000099341074, "median": 0.49000000953674316, "variance": 0.0005000000397364306, "stddev": 0.02236068066353148}, "is_objective": true, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055, 8.445248126983643]}, {"name": "val_loss", "best_value": 0.6896992802619935, "last_value": 0.6896992802619935, "direction": "min", "history": [0.720866551399231, 0.7018867993354797, 0.6992192125320434, 0.6992192125320434, 0.6992192125320434, 0.6896992802619935], "statistics": {"min": 0.6896992802619935, "max": 0.720866551399231, "mean": 0.7016850447654724, "median": 0.6992192125320434, "variance": 8.831173969842494e-05, "stddev": 0.009397432612071498}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055, 8.445248126983643]}], "best_instance": {"start_time": 1556848761, "idx": "982ebcaed2a590dd11d9194801ef8a1e", "training_size": 9900, "validation_size": 100, "batch_size": 32, "model_size": 5449, "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_config": "binary_crossentropy", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 24, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "hyper_parameters": {"layers:dims": {"name": "dims", "value": 24, "group": "layers"}, "layers:activation": {"name": "activation", "value": "relu", "group": "layers"}, "layers:extra_layer": {"name": "extra_layer", "value": false, "group": "layers"}, "optimizer:loss": {"name": "loss", "value": "binary_crossentropy", "group": "optimizer"}, "optimizer:lr": {"name": "lr", "value": 0.001, "group": "optimizer"}}, "is_best_model": true, "objective": "val_binary_accuracy", "executions": {"execution_states": [], "last_insert_idx": null}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5165656805038452, "last_value": 0.5165656805038452, "direction": "max", "history": [0.5093939304351807, 0.5081818103790283, 0.5165656805038452, 0.5165656805038452], "statistics": {"min": 0.5081818103790283, "max": 0.5165656805038452, "mean": 0.5126767754554749, "median": 0.5129798054695129, "variance": 1.5307236854056328e-05, "stddev": 0.003912446402707177}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "loss", "best_value": 0.6925253461587308, "last_value": 0.6925253461587308, "direction": "min", "history": [0.698443778235503, 0.6942108159354239, 0.6925253461587308, 0.6925253461587308], "statistics": {"min": 0.6925253461587308, "max": 0.698443778235503, "mean": 0.6944263216220972, "median": 0.6933680810470774, "variance": 5.853453941557023e-06, "stddev": 0.0024193912336695407}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "val_binary_accuracy", "best_value": 0.550000011920929, "last_value": 0.550000011920929, "direction": "max", "history": [0.47999998927116394, 0.550000011920929, 0.5099999904632568, 0.550000011920929], "statistics": {"min": 0.47999998927116394, "max": 0.550000011920929, "mean": 0.5225000008940697, "median": 0.5300000011920929, "variance": 0.0008687506154180791, "stddev": 0.029474575746193176}, "is_objective": true, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "val_loss", "best_value": 0.6896992802619935, "last_value": 0.6896992802619935, "direction": "min", "history": [0.6934040117263794, 0.6896992802619935, 0.6984535217285156, 0.6896992802619935], "statistics": {"min": 0.6896992802619935, "max": 0.6984535217285156, "mean": 0.6928140234947204, "median": 0.6915516459941864, "variance": 1.2888819313528002e-05, "stddev": 0.0035901001815447993}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}]}}, "instance": {"start_time": 1556848761, "idx": "982ebcaed2a590dd11d9194801ef8a1e", "training_size": 9900, "validation_size": 100, "batch_size": 32, "model_size": 5449, "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_config": "binary_crossentropy", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 24, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "hyper_parameters": {"layers:dims": {"name": "dims", "value": 24, "group": "layers"}, "layers:activation": {"name": "activation", "value": "relu", "group": "layers"}, "layers:extra_layer": {"name": "extra_layer", "value": false, "group": "layers"}, "optimizer:loss": {"name": "loss", "value": "binary_crossentropy", "group": "optimizer"}, "optimizer:lr": {"name": "lr", "value": 0.001, "group": "optimizer"}}, "is_best_model": true, "objective": "val_binary_accuracy", "executions": {"execution_states": [{"start_time": 1556848761, "idx": 1556848761, "epochs": 3, "max_epochs": 3, "eta": 4, "record_time": 1556848765, "metrics": [{"name": "binary_accuracy", "best_value": 0.5165656805038452, "last_value": 0.5165656805038452, "direction": "max", "history": [0.5093939304351807, 0.5081818103790283, 0.5165656805038452, 0.5165656805038452], "statistics": {"min": 0.5081818103790283, "max": 0.5165656805038452, "mean": 0.5126767754554749, "median": 0.5129798054695129, "variance": 1.5307236854056328e-05, "stddev": 0.003912446402707177}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "loss", "best_value": 0.6925253461587308, "last_value": 0.6925253461587308, "direction": "min", "history": [0.698443778235503, 0.6942108159354239, 0.6925253461587308, 0.6925253461587308], "statistics": {"min": 0.6925253461587308, "max": 0.698443778235503, "mean": 0.6944263216220972, "median": 0.6933680810470774, "variance": 5.853453941557023e-06, "stddev": 0.0024193912336695407}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "val_binary_accuracy", "best_value": 0.550000011920929, "last_value": 0.550000011920929, "direction": "max", "history": [0.47999998927116394, 0.550000011920929, 0.5099999904632568, 0.550000011920929], "statistics": {"min": 0.47999998927116394, "max": 0.550000011920929, "mean": 0.5225000008940697, "median": 0.5300000011920929, "variance": 0.0008687506154180791, "stddev": 0.029474575746193176}, "is_objective": true, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "val_loss", "best_value": 0.6896992802619935, "last_value": 0.6896992802619935, "direction": "min", "history": [0.6934040117263794, 0.6896992802619935, 0.6984535217285156, 0.6896992802619935], "statistics": {"min": 0.6896992802619935, "max": 0.6984535217285156, "mean": 0.6928140234947204, "median": 0.6915516459941864, "variance": 1.2888819313528002e-05, "stddev": 0.0035901001815447993}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}]}], "last_insert_idx": 1556848761}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5165656805038452, "last_value": 0.5165656805038452, "direction": "max", "history": [0.5093939304351807, 0.5081818103790283, 0.5165656805038452, 0.5165656805038452], "statistics": {"min": 0.5081818103790283, "max": 0.5165656805038452, "mean": 0.5126767754554749, "median": 0.5129798054695129, "variance": 1.5307236854056328e-05, "stddev": 0.003912446402707177}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "loss", "best_value": 0.6925253461587308, "last_value": 0.6925253461587308, "direction": "min", "history": [0.698443778235503, 0.6942108159354239, 0.6925253461587308, 0.6925253461587308], "statistics": {"min": 0.6925253461587308, "max": 0.698443778235503, "mean": 0.6944263216220972, "median": 0.6933680810470774, "variance": 5.853453941557023e-06, "stddev": 0.0024193912336695407}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "val_binary_accuracy", "best_value": 0.550000011920929, "last_value": 0.550000011920929, "direction": "max", "history": [0.47999998927116394, 0.550000011920929, 0.5099999904632568, 0.550000011920929], "statistics": {"min": 0.47999998927116394, "max": 0.550000011920929, "mean": 0.5225000008940697, "median": 0.5300000011920929, "variance": 0.0008687506154180791, "stddev": 0.029474575746193176}, "is_objective": true, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}, {"name": "val_loss", "best_value": 0.6896992802619935, "last_value": 0.6896992802619935, "direction": "min", "history": [0.6934040117263794, 0.6896992802619935, 0.6984535217285156, 0.6896992802619935], "statistics": {"min": 0.6896992802619935, "max": 0.6984535217285156, "mean": 0.6928140234947204, "median": 0.6915516459941864, "variance": 1.2888819313528002e-05, "stddev": 0.0035901001815447993}, "is_objective": false, "start_time": 1556848761.9065118, "wall_time": [1.714205026626587, 2.853963613510132, 3.9682135581970215, 3.976191520690918]}]}, "hparams": {"layers:dims": {"name": "dims", "group": "layers", "type": "Range", "space_size": 8, "start": 16, "stop": 32, "values": [16, 18, 20, 22, 24, 26, 28, 30]}, "layers:activation": {"name": "activation", "group": "layers", "type": "Choice", "space_size": 2, "start": "relu", "stop": "tanh", "values": ["relu", "tanh"]}, "layers:extra_layer": {"name": "extra_layer", "group": "layers", "type": "Boolean", "space_size": 2, "start": true, "stop": false, "values": [true, false]}, "optimizer:loss": {"name": "loss", "group": "optimizer", "type": "Choice", "space_size": 2, "start": "binary_crossentropy", "stop": "mse", "values": ["binary_crossentropy", "mse"]}, "optimizer:lr": {"name": "lr", "group": "optimizer", "type": "Choice", "space_size": 3, "start": 0.01, "stop": 0.0001, "values": [0.01, 0.001, 0.0001]}}}