{"update_time": 1556848657, "tuner": {"name": "RandomSearch", "objective": "val_binary_accuracy", "start_time": 1556848643, "remaining_budget": 0, "eta": 0, "epoch_budget": 9, "max_epochs": 3, "min_epochs": 3, "project": "default", "architecture": "default", "user_info": {}, "num_executions": 1, "max_model_parameters": 25000000, "checkpoint": true, "dry_run": false, "debug": false, "display_model": false, "stats": {"num_generated_models": 3, "num_invalid_models": 0, "num_mdl_previously_trained": 0, "num_collision": 0, "num_over_sized_models": 0}, "host": {"result_dir": "results/", "tmp_dir": "tmp/", "export_dir": "export/", "cpu": {"name": "Intel64 Family 6 Model 158 Stepping 10, GenuineIntel", "core_count": 12, "usage": 25.0, "frequency": {"unit": "MHZ", "current": 3696.0, "max": 3696.0}}, "ram": {"unit": "MB", "used": 13666, "total": 65450}, "gpu": [{"memory": {"unit": "MB", "total": 11264, "used": 10621}, "temperature": {"unit": "C", "value": 59}, "index": "0", "name": "GeForce RTX 2080 Ti", "usage": "15", "uuid": "GPU-e883dd3c-e24c-249e-a7e1-00f9c6c149a0"}], "uptime": 988638, "disk": [{"name": "C:\\", "unit": "GB", "used": 697, "total": 953}, {"name": "D:\\", "unit": "GB", "used": 1642, "total": 1862}], "software": {"kerastuner": "0.8.2", "tensorflow": "1.13.1", "tensorflow_use_gpu": true, "python": "3.6.7rc1", "os": {"name": "Windows", "version": "10.0.17134"}, "gpu_driver": "419.35"}, "hostname": "Emerald", "available_gpu": 1}, "metrics": {}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5120202302932739, "last_value": 0.5026262402534485, "direction": "max", "history": [0.49272727966308594, 0.4978787899017334, 0.49848484992980957, 0.49848484992980957, 0.49848484992980957, 0.5120202302932739, 0.5026262402534485], "statistics": {"min": 0.49272727966308594, "max": 0.5120202302932739, "mean": 0.5001010128429958, "median": 0.49848484992980957, "variance": 3.0798668799509784e-05, "stddev": 0.005549654836069518}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445, 8.38656997680664, 12.35839319229126]}, {"name": "loss", "best_value": 0.24997160722510983, "last_value": 0.2509655225517774, "direction": "min", "history": [0.710935628269658, 0.7007057913626084, 0.6973865666293134, 0.6973865666293134, 0.6973865666293134, 0.24997160722510983, 0.2509655225517774], "statistics": {"min": 0.24997160722510983, "max": 0.710935628269658, "mean": 0.5721054641852991, "median": 0.6973865666293134, "variance": 0.041399858058713324, "stddev": 0.2034695506917763}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445, 8.38656997680664, 12.35839319229126]}, {"name": "val_binary_accuracy", "best_value": 0.6100000143051147, "last_value": 0.5699999928474426, "direction": "max", "history": [0.550000011920929, 0.5099999904632568, 0.49000000953674316, 0.550000011920929, 0.550000011920929, 0.6100000143051147, 0.5699999928474426], "statistics": {"min": 0.49000000953674316, "max": 0.6100000143051147, "mean": 0.5471428632736206, "median": 0.550000011920929, "variance": 0.0013061226338757187, "stddev": 0.03614031867424136}, "is_objective": true, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445, 8.38656997680664, 12.35839319229126]}, {"name": "val_loss", "best_value": 0.2451230776309967, "last_value": 0.24780989289283753, "direction": "min", "history": [0.7081533765792847, 0.7023491334915161, 0.6994483923912048, 0.6994483923912048, 0.6994483923912048, 0.2451230776309967, 0.24780989289283753], "statistics": {"min": 0.2451230776309967, "max": 0.7081533765792847, "mean": 0.5716829511097499, "median": 0.6994483923912048, "variance": 0.04231499442983291, "stddev": 0.20570608748851577}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445, 8.38656997680664, 12.35839319229126]}], "best_instance": {"start_time": 1556848649, "idx": "50093e566a6e9b0dae6420d29e99d0f0", "training_size": 9900, "validation_size": 100, "batch_size": 32, "model_size": 6991, "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_config": "mse", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 30, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "hyper_parameters": {"layers:dims": {"name": "dims", "value": 30, "group": "layers"}, "layers:activation": {"name": "activation", "value": "tanh", "group": "layers"}, "layers:extra_layer": {"name": "extra_layer", "value": false, "group": "layers"}, "optimizer:loss": {"name": "loss", "value": "mse", "group": "optimizer"}, "optimizer:lr": {"name": "lr", "value": 0.001, "group": "optimizer"}}, "is_best_model": true, "objective": "val_binary_accuracy", "executions": {"execution_states": [], "last_insert_idx": null}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5120202302932739, "last_value": 0.5120202302932739, "direction": "max", "history": [0.493030309677124, 0.5049495100975037, 0.5120202302932739, 0.5120202302932739], "statistics": {"min": 0.493030309677124, "max": 0.5120202302932739, "mean": 0.5055050700902939, "median": 0.5084848701953888, "variance": 6.0205729803142205e-05, "stddev": 0.0077592351300332565}, "is_objective": false, "start_time": 1556848649.3409486, "wall_time": [1.5329265594482422, 2.620065689086914, 3.67445707321167, 3.7093863487243652]}, {"name": "loss", "best_value": 0.24997160722510983, "last_value": 0.24997160722510983, "direction": "min", "history": [0.25321865741050603, 0.250760580132706, 0.24997160722510983, 0.24997160722510983], "statistics": {"min": 0.24997160722510983, "max": 0.25321865741050603, "mean": 0.25098061299835794, "median": 0.25036609367890794, "variance": 1.773360638402579e-06, "stddev": 0.001331675875880681}, "is_objective": false, "start_time": 1556848649.3409486, "wall_time": [1.5329265594482422, 2.620065689086914, 3.67445707321167, 3.7093863487243652]}, {"name": "val_binary_accuracy", "best_value": 0.6100000143051147, "last_value": 0.6100000143051147, "direction": "max", "history": [0.47999998927116394, 0.6000000238418579, 0.6100000143051147, 0.6100000143051147], "statistics": {"min": 0.47999998927116394, "max": 0.6100000143051147, "mean": 0.5750000104308128, "median": 0.6050000190734863, "variance": 0.0030250013083221172, "stddev": 0.055000011893836145}, "is_objective": true, "start_time": 1556848649.3409486, "wall_time": [1.5329265594482422, 2.620065689086914, 3.67445707321167, 3.7093863487243652]}, {"name": "val_loss", "best_value": 0.2451230776309967, "last_value": 0.2451230776309967, "direction": "min", "history": [0.24893978118896484, 0.24701648831367493, 0.2451230776309967, 0.2451230776309967], "statistics": {"min": 0.2451230776309967, "max": 0.24893978118896484, "mean": 0.2465506061911583, "median": 0.2460697829723358, "variance": 2.500219725594656e-06, "stddev": 0.0015812083118914649}, "is_objective": false, "start_time": 1556848649.3409486, "wall_time": [1.5329265594482422, 2.620065689086914, 3.67445707321167, 3.7093863487243652]}]}}, "instance": {"start_time": 1556848653, "idx": "183e6d8f8e80db63355a93bd41479e27", "training_size": 9900, "validation_size": 100, "batch_size": 32, "model_size": 4951, "optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_config": "mse", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 22, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 22, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "hyper_parameters": {"layers:dims": {"name": "dims", "value": 22, "group": "layers"}, "layers:activation": {"name": "activation", "value": "relu", "group": "layers"}, "layers:extra_layer": {"name": "extra_layer", "value": false, "group": "layers"}, "optimizer:loss": {"name": "loss", "value": "mse", "group": "optimizer"}, "optimizer:lr": {"name": "lr", "value": 0.0001, "group": "optimizer"}}, "is_best_model": false, "objective": "val_binary_accuracy", "executions": {"execution_states": [{"start_time": 1556848653, "idx": 1556848653, "epochs": 3, "max_epochs": 3, "eta": 4, "record_time": 1556848657, "metrics": [{"name": "binary_accuracy", "best_value": 0.5026262402534485, "last_value": 0.5026262402534485, "direction": "max", "history": [0.49666666984558105, 0.5026262402534485, 0.4978787899017334, 0.5026262402534485], "statistics": {"min": 0.49666666984558105, "max": 0.5026262402534485, "mean": 0.49994948506355286, "median": 0.5002525150775909, "variance": 7.348672725449035e-06, "stddev": 0.0027108435449964712}, "is_objective": false, "start_time": 1556848653.3037179, "wall_time": [1.6035397052764893, 2.651547431945801, 3.7104604244232178, 3.718440294265747]}, {"name": "loss", "best_value": 0.2509655225517774, "last_value": 0.2509655225517774, "direction": "min", "history": [0.2559691079457601, 0.25169464748315135, 0.2509655225517774, 0.2509655225517774], "statistics": {"min": 0.2509655225517774, "max": 0.2559691079457601, "mean": 0.25239870013311655, "median": 0.25133008501746434, "variance": 4.33787451045387e-06, "stddev": 0.0020827564693102914}, "is_objective": false, "start_time": 1556848653.3037179, "wall_time": [1.6035397052764893, 2.651547431945801, 3.7104604244232178, 3.718440294265747]}, {"name": "val_binary_accuracy", "best_value": 0.5699999928474426, "last_value": 0.5699999928474426, "direction": "max", "history": [0.5699999928474426, 0.550000011920929, 0.5600000023841858, 0.5699999928474426], "statistics": {"min": 0.550000011920929, "max": 0.5699999928474426, "mean": 0.5625, "median": 0.5649999976158142, "variance": 6.874986886984402e-05, "stddev": 0.008291554068438801}, "is_objective": true, "start_time": 1556848653.3037179, "wall_time": [1.6035397052764893, 2.651547431945801, 3.7104604244232178, 3.718440294265747]}, {"name": "val_loss", "best_value": 0.24780989289283753, "last_value": 0.24780989289283753, "direction": "min", "history": [0.24780989289283753, 0.24941882252693176, 0.24928855895996094, 0.24780989289283753], "statistics": {"min": 0.24780989289283753, "max": 0.24941882252693176, "mean": 0.24858179181814194, "median": 0.24854922592639922, "variance": 5.979490254960977e-07, "stddev": 0.0007732716375867523}, "is_objective": false, "start_time": 1556848653.3037179, "wall_time": [1.6035397052764893, 2.651547431945801, 3.7104604244232178, 3.718440294265747]}]}], "last_insert_idx": 1556848653}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5026262402534485, "last_value": 0.5026262402534485, "direction": "max", "history": [0.49666666984558105, 0.5026262402534485, 0.4978787899017334, 0.5026262402534485], "statistics": {"min": 0.49666666984558105, "max": 0.5026262402534485, "mean": 0.49994948506355286, "median": 0.5002525150775909, "variance": 7.348672725449035e-06, "stddev": 0.0027108435449964712}, "is_objective": false, "start_time": 1556848653.3037179, "wall_time": [1.6035397052764893, 2.651547431945801, 3.7104604244232178, 3.718440294265747]}, {"name": "loss", "best_value": 0.2509655225517774, "last_value": 0.2509655225517774, "direction": "min", "history": [0.2559691079457601, 0.25169464748315135, 0.2509655225517774, 0.2509655225517774], "statistics": {"min": 0.2509655225517774, "max": 0.2559691079457601, "mean": 0.25239870013311655, "median": 0.25133008501746434, "variance": 4.33787451045387e-06, "stddev": 0.0020827564693102914}, "is_objective": false, "start_time": 1556848653.3037179, "wall_time": [1.6035397052764893, 2.651547431945801, 3.7104604244232178, 3.718440294265747]}, {"name": "val_binary_accuracy", "best_value": 0.5699999928474426, "last_value": 0.5699999928474426, "direction": "max", "history": [0.5699999928474426, 0.550000011920929, 0.5600000023841858, 0.5699999928474426], "statistics": {"min": 0.550000011920929, "max": 0.5699999928474426, "mean": 0.5625, "median": 0.5649999976158142, "variance": 6.874986886984402e-05, "stddev": 0.008291554068438801}, "is_objective": true, "start_time": 1556848653.3037179, "wall_time": [1.6035397052764893, 2.651547431945801, 3.7104604244232178, 3.718440294265747]}, {"name": "val_loss", "best_value": 0.24780989289283753, "last_value": 0.24780989289283753, "direction": "min", "history": [0.24780989289283753, 0.24941882252693176, 0.24928855895996094, 0.24780989289283753], "statistics": {"min": 0.24780989289283753, "max": 0.24941882252693176, "mean": 0.24858179181814194, "median": 0.24854922592639922, "variance": 5.979490254960977e-07, "stddev": 0.0007732716375867523}, "is_objective": false, "start_time": 1556848653.3037179, "wall_time": [1.6035397052764893, 2.651547431945801, 3.7104604244232178, 3.718440294265747]}]}, "hparams": {"layers:dims": {"name": "dims", "group": "layers", "type": "Range", "space_size": 8, "start": 16, "stop": 32, "values": [16, 18, 20, 22, 24, 26, 28, 30]}, "layers:activation": {"name": "activation", "group": "layers", "type": "Choice", "space_size": 2, "start": "relu", "stop": "tanh", "values": ["relu", "tanh"]}, "layers:extra_layer": {"name": "extra_layer", "group": "layers", "type": "Boolean", "space_size": 2, "start": true, "stop": false, "values": [true, false]}, "optimizer:loss": {"name": "loss", "group": "optimizer", "type": "Choice", "space_size": 2, "start": "binary_crossentropy", "stop": "mse", "values": ["binary_crossentropy", "mse"]}, "optimizer:lr": {"name": "lr", "group": "optimizer", "type": "Choice", "space_size": 3, "start": 0.01, "stop": 0.0001, "values": [0.01, 0.001, 0.0001]}}}