{"config": {"name": "sequential", "layers": [{"config": {"name": "dense", "activation": "linear", "activity_regularizer": null, "units": 26, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 200], "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_1", "activation": "relu", "activity_regularizer": null, "units": 26, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "sigmoid", "activity_regularizer": null, "units": 1, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow"}