{"update_time": 1556848761, "tuner": {"name": "RandomSearch", "objective": "val_binary_accuracy", "start_time": 1556848755, "remaining_budget": 6, "eta": 6, "epoch_budget": 9, "max_epochs": 3, "min_epochs": 3, "project": "default", "architecture": "default", "user_info": {}, "num_executions": 1, "max_model_parameters": 25000000, "checkpoint": true, "dry_run": false, "debug": false, "display_model": false, "stats": {"num_generated_models": 1, "num_invalid_models": 0, "num_mdl_previously_trained": 0, "num_collision": 0, "num_over_sized_models": 0}, "host": {"result_dir": "results/", "tmp_dir": "tmp/", "export_dir": "export/", "cpu": {"name": "Intel64 Family 6 Model 158 Stepping 10, GenuineIntel", "core_count": 12, "usage": 28.0, "frequency": {"unit": "MHZ", "current": 3696.0, "max": 3696.0}}, "ram": {"unit": "MB", "used": 13884, "total": 65450}, "gpu": [{"memory": {"unit": "MB", "total": 11264, "used": 10514}, "temperature": {"unit": "C", "value": 58}, "index": "0", "name": "GeForce RTX 2080 Ti", "usage": "22", "uuid": "GPU-e883dd3c-e24c-249e-a7e1-00f9c6c149a0"}], "uptime": 988745, "disk": [{"name": "C:\\", "unit": "GB", "used": 697, "total": 953}, {"name": "D:\\", "unit": "GB", "used": 1642, "total": 1862}], "software": {"kerastuner": "0.8.2", "tensorflow": "1.13.1", "tensorflow_use_gpu": true, "python": "3.6.7rc1", "os": {"name": "Windows", "version": "10.0.17134"}, "gpu_driver": "419.35"}, "hostname": "Emerald", "available_gpu": 1}, "metrics": {}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5112121105194092, "last_value": 0.5112121105194092, "direction": "max", "history": [0.509797990322113, 0.510606050491333, 0.5112121105194092, 0.5112121105194092, 0.5112121105194092], "statistics": {"min": 0.509797990322113, "max": 0.5112121105194092, "mean": 0.5108080744743347, "median": 0.5112121105194092, "variance": 3.101638122871009e-07, "stddev": 0.0005569235246307171}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "loss", "best_value": 0.6960504973295963, "last_value": 0.6960504973295963, "direction": "min", "history": [0.7156840212899025, 0.700234091956206, 0.6960504973295963, 0.6960504973295963, 0.6960504973295963], "statistics": {"min": 0.6960504973295963, "max": 0.7156840212899025, "mean": 0.7008139210469795, "median": 0.6960504973295963, "variance": 5.790533990861419e-05, "stddev": 0.007609555828602232}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "val_binary_accuracy", "best_value": 0.49000000953674316, "last_value": 0.49000000953674316, "direction": "max", "history": [0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316], "statistics": {"min": 0.49000000953674316, "max": 0.49000000953674316, "mean": 0.49000000953674316, "median": 0.49000000953674316, "variance": 0.0, "stddev": 0.0}, "is_objective": true, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "val_loss", "best_value": 0.6992192125320434, "last_value": 0.6992192125320434, "direction": "min", "history": [0.720866551399231, 0.7018867993354797, 0.6992192125320434, 0.6992192125320434, 0.6992192125320434], "statistics": {"min": 0.6992192125320434, "max": 0.720866551399231, "mean": 0.7040821976661682, "median": 0.6992192125320434, "variance": 7.149603546222449e-05, "stddev": 0.008455532831361042}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}], "best_instance": {"start_time": 1556848757, "idx": "69b1c4ba03bb7aafd199a0ae41a86066", "training_size": 9900, "validation_size": 100, "batch_size": 32, "model_size": 6469, "optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_config": "binary_crossentropy", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 28, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 28, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "hyper_parameters": {"layers:dims": {"name": "dims", "value": 28, "group": "layers"}, "layers:activation": {"name": "activation", "value": "tanh", "group": "layers"}, "layers:extra_layer": {"name": "extra_layer", "value": false, "group": "layers"}, "optimizer:loss": {"name": "loss", "value": "binary_crossentropy", "group": "optimizer"}, "optimizer:lr": {"name": "lr", "value": 0.0001, "group": "optimizer"}}, "is_best_model": false, "objective": "val_binary_accuracy", "executions": {"execution_states": [], "last_insert_idx": null}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5112121105194092, "last_value": 0.5112121105194092, "direction": "max", "history": [0.509797990322113, 0.510606050491333, 0.5112121105194092, 0.5112121105194092, 0.5112121105194092], "statistics": {"min": 0.509797990322113, "max": 0.5112121105194092, "mean": 0.5108080744743347, "median": 0.5112121105194092, "variance": 3.101638122871009e-07, "stddev": 0.0005569235246307171}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "loss", "best_value": 0.6960504973295963, "last_value": 0.6960504973295963, "direction": "min", "history": [0.7156840212899025, 0.700234091956206, 0.6960504973295963, 0.6960504973295963, 0.6960504973295963], "statistics": {"min": 0.6960504973295963, "max": 0.7156840212899025, "mean": 0.7008139210469795, "median": 0.6960504973295963, "variance": 5.790533990861419e-05, "stddev": 0.007609555828602232}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "val_binary_accuracy", "best_value": 0.49000000953674316, "last_value": 0.49000000953674316, "direction": "max", "history": [0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316], "statistics": {"min": 0.49000000953674316, "max": 0.49000000953674316, "mean": 0.49000000953674316, "median": 0.49000000953674316, "variance": 0.0, "stddev": 0.0}, "is_objective": true, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "val_loss", "best_value": 0.6992192125320434, "last_value": 0.6992192125320434, "direction": "min", "history": [0.720866551399231, 0.7018867993354797, 0.6992192125320434, 0.6992192125320434, 0.6992192125320434], "statistics": {"min": 0.6992192125320434, "max": 0.720866551399231, "mean": 0.7040821976661682, "median": 0.6992192125320434, "variance": 7.149603546222449e-05, "stddev": 0.008455532831361042}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}]}}, "instance": {"start_time": 1556848757, "idx": "69b1c4ba03bb7aafd199a0ae41a86066", "training_size": 9900, "validation_size": 100, "batch_size": 32, "model_size": 6469, "optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_config": "binary_crossentropy", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 28, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 28, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "hyper_parameters": {"layers:dims": {"name": "dims", "value": 28, "group": "layers"}, "layers:activation": {"name": "activation", "value": "tanh", "group": "layers"}, "layers:extra_layer": {"name": "extra_layer", "value": false, "group": "layers"}, "optimizer:loss": {"name": "loss", "value": "binary_crossentropy", "group": "optimizer"}, "optimizer:lr": {"name": "lr", "value": 0.0001, "group": "optimizer"}}, "is_best_model": false, "objective": "val_binary_accuracy", "executions": {"execution_states": [{"start_time": 1556848757, "idx": 1556848757, "epochs": 3, "max_epochs": 3, "eta": 4, "record_time": 1556848761, "metrics": [{"name": "binary_accuracy", "best_value": 0.5112121105194092, "last_value": 0.5112121105194092, "direction": "max", "history": [0.509797990322113, 0.510606050491333, 0.5112121105194092, 0.5112121105194092, 0.5112121105194092], "statistics": {"min": 0.509797990322113, "max": 0.5112121105194092, "mean": 0.5108080744743347, "median": 0.5112121105194092, "variance": 3.101638122871009e-07, "stddev": 0.0005569235246307171}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "loss", "best_value": 0.6960504973295963, "last_value": 0.6960504973295963, "direction": "min", "history": [0.7156840212899025, 0.700234091956206, 0.6960504973295963, 0.6960504973295963, 0.6960504973295963], "statistics": {"min": 0.6960504973295963, "max": 0.7156840212899025, "mean": 0.7008139210469795, "median": 0.6960504973295963, "variance": 5.790533990861419e-05, "stddev": 0.007609555828602232}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "val_binary_accuracy", "best_value": 0.49000000953674316, "last_value": 0.49000000953674316, "direction": "max", "history": [0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316], "statistics": {"min": 0.49000000953674316, "max": 0.49000000953674316, "mean": 0.49000000953674316, "median": 0.49000000953674316, "variance": 0.0, "stddev": 0.0}, "is_objective": true, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "val_loss", "best_value": 0.6992192125320434, "last_value": 0.6992192125320434, "direction": "min", "history": [0.720866551399231, 0.7018867993354797, 0.6992192125320434, 0.6992192125320434, 0.6992192125320434], "statistics": {"min": 0.6992192125320434, "max": 0.720866551399231, "mean": 0.7040821976661682, "median": 0.6992192125320434, "variance": 7.149603546222449e-05, "stddev": 0.008455532831361042}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}]}], "last_insert_idx": 1556848757}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.5112121105194092, "last_value": 0.5112121105194092, "direction": "max", "history": [0.509797990322113, 0.510606050491333, 0.5112121105194092, 0.5112121105194092, 0.5112121105194092], "statistics": {"min": 0.509797990322113, "max": 0.5112121105194092, "mean": 0.5108080744743347, "median": 0.5112121105194092, "variance": 3.101638122871009e-07, "stddev": 0.0005569235246307171}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "loss", "best_value": 0.6960504973295963, "last_value": 0.6960504973295963, "direction": "min", "history": [0.7156840212899025, 0.700234091956206, 0.6960504973295963, 0.6960504973295963, 0.6960504973295963], "statistics": {"min": 0.6960504973295963, "max": 0.7156840212899025, "mean": 0.7008139210469795, "median": 0.6960504973295963, "variance": 5.790533990861419e-05, "stddev": 0.007609555828602232}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "val_binary_accuracy", "best_value": 0.49000000953674316, "last_value": 0.49000000953674316, "direction": "max", "history": [0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.49000000953674316], "statistics": {"min": 0.49000000953674316, "max": 0.49000000953674316, "mean": 0.49000000953674316, "median": 0.49000000953674316, "variance": 0.0, "stddev": 0.0}, "is_objective": true, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}, {"name": "val_loss", "best_value": 0.6992192125320434, "last_value": 0.6992192125320434, "direction": "min", "history": [0.720866551399231, 0.7018867993354797, 0.6992192125320434, 0.6992192125320434, 0.6992192125320434], "statistics": {"min": 0.6992192125320434, "max": 0.720866551399231, "mean": 0.7040821976661682, "median": 0.6992192125320434, "variance": 7.149603546222449e-05, "stddev": 0.008455532831361042}, "is_objective": false, "start_time": 1556848757.4374552, "wall_time": [2.020723819732666, 3.1143970489501953, 4.194554805755615, 4.2035322189331055, 4.2035322189331055]}]}, "hparams": {"layers:dims": {"name": "dims", "group": "layers", "type": "Range", "space_size": 8, "start": 16, "stop": 32, "values": [16, 18, 20, 22, 24, 26, 28, 30]}, "layers:activation": {"name": "activation", "group": "layers", "type": "Choice", "space_size": 2, "start": "relu", "stop": "tanh", "values": ["relu", "tanh"]}, "layers:extra_layer": {"name": "extra_layer", "group": "layers", "type": "Boolean", "space_size": 2, "start": true, "stop": false, "values": [true, false]}, "optimizer:loss": {"name": "loss", "group": "optimizer", "type": "Choice", "space_size": 2, "start": "binary_crossentropy", "stop": "mse", "values": ["binary_crossentropy", "mse"]}, "optimizer:lr": {"name": "lr", "group": "optimizer", "type": "Choice", "space_size": 3, "start": 0.01, "stop": 0.0001, "values": [0.01, 0.001, 0.0001]}}}