{"update_time": 1556848649, "tuner": {"name": "RandomSearch", "objective": "val_binary_accuracy", "start_time": 1556848643, "remaining_budget": 6, "eta": 6, "epoch_budget": 9, "max_epochs": 3, "min_epochs": 3, "project": "default", "architecture": "default", "user_info": {}, "num_executions": 1, "max_model_parameters": 25000000, "checkpoint": true, "dry_run": false, "debug": false, "display_model": false, "stats": {"num_generated_models": 1, "num_invalid_models": 0, "num_mdl_previously_trained": 0, "num_collision": 0, "num_over_sized_models": 0}, "host": {"result_dir": "results/", "tmp_dir": "tmp/", "export_dir": "export/", "cpu": {"name": "Intel64 Family 6 Model 158 Stepping 10, GenuineIntel", "core_count": 12, "usage": 27.9, "frequency": {"unit": "MHZ", "current": 3696.0, "max": 3696.0}}, "ram": {"unit": "MB", "used": 13595, "total": 65450}, "gpu": [{"memory": {"unit": "MB", "total": 11264, "used": 10628}, "temperature": {"unit": "C", "value": 59}, "index": "0", "name": "GeForce RTX 2080 Ti", "usage": "26", "uuid": "GPU-e883dd3c-e24c-249e-a7e1-00f9c6c149a0"}], "uptime": 988632, "disk": [{"name": "C:\\", "unit": "GB", "used": 697, "total": 953}, {"name": "D:\\", "unit": "GB", "used": 1642, "total": 1862}], "software": {"kerastuner": "0.8.2", "tensorflow": "1.13.1", "tensorflow_use_gpu": true, "python": "3.6.7rc1", "os": {"name": "Windows", "version": "10.0.17134"}, "gpu_driver": "419.35"}, "hostname": "Emerald", "available_gpu": 1}, "metrics": {}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.49848484992980957, "last_value": 0.49848484992980957, "direction": "max", "history": [0.49272727966308594, 0.4978787899017334, 0.49848484992980957, 0.49848484992980957, 0.49848484992980957], "statistics": {"min": 0.49272727966308594, "max": 0.49848484992980957, "mean": 0.4972121238708496, "median": 0.49848484992980957, "variance": 5.083553205622594e-06, "stddev": 0.002254673636166129}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "loss", "best_value": 0.6973865666293134, "last_value": 0.6973865666293134, "direction": "min", "history": [0.710935628269658, 0.7007057913626084, 0.6973865666293134, 0.6973865666293134, 0.6973865666293134], "statistics": {"min": 0.6973865666293134, "max": 0.710935628269658, "mean": 0.7007602239040414, "median": 0.6973865666293134, "variance": 2.7537301425470048e-05, "stddev": 0.005247599586998807}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "val_binary_accuracy", "best_value": 0.550000011920929, "last_value": 0.550000011920929, "direction": "max", "history": [0.550000011920929, 0.5099999904632568, 0.49000000953674316, 0.550000011920929, 0.550000011920929], "statistics": {"min": 0.49000000953674316, "max": 0.550000011920929, "mean": 0.5300000071525574, "median": 0.550000011920929, "variance": 0.00064000020980842, "stddev": 0.025298225428049693}, "is_objective": true, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "val_loss", "best_value": 0.6994483923912048, "last_value": 0.6994483923912048, "direction": "min", "history": [0.7081533765792847, 0.7023491334915161, 0.6994483923912048, 0.6994483923912048, 0.6994483923912048], "statistics": {"min": 0.6994483923912048, "max": 0.7081533765792847, "mean": 0.701769537448883, "median": 0.6994483923912048, "variance": 1.1450495350367013e-05, "stddev": 0.003383858057065487}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}], "best_instance": {"start_time": 1556848644, "idx": "bb7685b5de090d6efbfc52b5132c31da", "training_size": 9900, "validation_size": 100, "batch_size": 32, "model_size": 3505, "optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_config": "binary_crossentropy", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "hyper_parameters": {"layers:dims": {"name": "dims", "value": 16, "group": "layers"}, "layers:activation": {"name": "activation", "value": "tanh", "group": "layers"}, "layers:extra_layer": {"name": "extra_layer", "value": false, "group": "layers"}, "optimizer:loss": {"name": "loss", "value": "binary_crossentropy", "group": "optimizer"}, "optimizer:lr": {"name": "lr", "value": 0.0001, "group": "optimizer"}}, "is_best_model": false, "objective": "val_binary_accuracy", "executions": {"execution_states": [], "last_insert_idx": null}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.49848484992980957, "last_value": 0.49848484992980957, "direction": "max", "history": [0.49272727966308594, 0.4978787899017334, 0.49848484992980957, 0.49848484992980957, 0.49848484992980957], "statistics": {"min": 0.49272727966308594, "max": 0.49848484992980957, "mean": 0.4972121238708496, "median": 0.49848484992980957, "variance": 5.083553205622594e-06, "stddev": 0.002254673636166129}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "loss", "best_value": 0.6973865666293134, "last_value": 0.6973865666293134, "direction": "min", "history": [0.710935628269658, 0.7007057913626084, 0.6973865666293134, 0.6973865666293134, 0.6973865666293134], "statistics": {"min": 0.6973865666293134, "max": 0.710935628269658, "mean": 0.7007602239040414, "median": 0.6973865666293134, "variance": 2.7537301425470048e-05, "stddev": 0.005247599586998807}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "val_binary_accuracy", "best_value": 0.550000011920929, "last_value": 0.550000011920929, "direction": "max", "history": [0.550000011920929, 0.5099999904632568, 0.49000000953674316, 0.550000011920929, 0.550000011920929], "statistics": {"min": 0.49000000953674316, "max": 0.550000011920929, "mean": 0.5300000071525574, "median": 0.550000011920929, "variance": 0.00064000020980842, "stddev": 0.025298225428049693}, "is_objective": true, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "val_loss", "best_value": 0.6994483923912048, "last_value": 0.6994483923912048, "direction": "min", "history": [0.7081533765792847, 0.7023491334915161, 0.6994483923912048, 0.6994483923912048, 0.6994483923912048], "statistics": {"min": 0.6994483923912048, "max": 0.7081533765792847, "mean": 0.701769537448883, "median": 0.6994483923912048, "variance": 1.1450495350367013e-05, "stddev": 0.003383858057065487}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}]}}, "instance": {"start_time": 1556848644, "idx": "bb7685b5de090d6efbfc52b5132c31da", "training_size": 9900, "validation_size": 100, "batch_size": 32, "model_size": 3505, "optimizer_config": {"class_name": "Adam", "config": {"lr": 9.999999747378752e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss_config": "binary_crossentropy", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 200], "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "hyper_parameters": {"layers:dims": {"name": "dims", "value": 16, "group": "layers"}, "layers:activation": {"name": "activation", "value": "tanh", "group": "layers"}, "layers:extra_layer": {"name": "extra_layer", "value": false, "group": "layers"}, "optimizer:loss": {"name": "loss", "value": "binary_crossentropy", "group": "optimizer"}, "optimizer:lr": {"name": "lr", "value": 0.0001, "group": "optimizer"}}, "is_best_model": false, "objective": "val_binary_accuracy", "executions": {"execution_states": [{"start_time": 1556848644, "idx": 1556848644, "epochs": 3, "max_epochs": 3, "eta": 5, "record_time": 1556848649, "metrics": [{"name": "binary_accuracy", "best_value": 0.49848484992980957, "last_value": 0.49848484992980957, "direction": "max", "history": [0.49272727966308594, 0.4978787899017334, 0.49848484992980957, 0.49848484992980957, 0.49848484992980957], "statistics": {"min": 0.49272727966308594, "max": 0.49848484992980957, "mean": 0.4972121238708496, "median": 0.49848484992980957, "variance": 5.083553205622594e-06, "stddev": 0.002254673636166129}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "loss", "best_value": 0.6973865666293134, "last_value": 0.6973865666293134, "direction": "min", "history": [0.710935628269658, 0.7007057913626084, 0.6973865666293134, 0.6973865666293134, 0.6973865666293134], "statistics": {"min": 0.6973865666293134, "max": 0.710935628269658, "mean": 0.7007602239040414, "median": 0.6973865666293134, "variance": 2.7537301425470048e-05, "stddev": 0.005247599586998807}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "val_binary_accuracy", "best_value": 0.550000011920929, "last_value": 0.550000011920929, "direction": "max", "history": [0.550000011920929, 0.5099999904632568, 0.49000000953674316, 0.550000011920929, 0.550000011920929], "statistics": {"min": 0.49000000953674316, "max": 0.550000011920929, "mean": 0.5300000071525574, "median": 0.550000011920929, "variance": 0.00064000020980842, "stddev": 0.025298225428049693}, "is_objective": true, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "val_loss", "best_value": 0.6994483923912048, "last_value": 0.6994483923912048, "direction": "min", "history": [0.7081533765792847, 0.7023491334915161, 0.6994483923912048, 0.6994483923912048, 0.6994483923912048], "statistics": {"min": 0.6994483923912048, "max": 0.7081533765792847, "mean": 0.701769537448883, "median": 0.6994483923912048, "variance": 1.1450495350367013e-05, "stddev": 0.003383858057065487}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}]}], "last_insert_idx": 1556848644}, "aggregate_metrics": [{"name": "binary_accuracy", "best_value": 0.49848484992980957, "last_value": 0.49848484992980957, "direction": "max", "history": [0.49272727966308594, 0.4978787899017334, 0.49848484992980957, 0.49848484992980957, 0.49848484992980957], "statistics": {"min": 0.49272727966308594, "max": 0.49848484992980957, "mean": 0.4972121238708496, "median": 0.49848484992980957, "variance": 5.083553205622594e-06, "stddev": 0.002254673636166129}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "loss", "best_value": 0.6973865666293134, "last_value": 0.6973865666293134, "direction": "min", "history": [0.710935628269658, 0.7007057913626084, 0.6973865666293134, 0.6973865666293134, 0.6973865666293134], "statistics": {"min": 0.6973865666293134, "max": 0.710935628269658, "mean": 0.7007602239040414, "median": 0.6973865666293134, "variance": 2.7537301425470048e-05, "stddev": 0.005247599586998807}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "val_binary_accuracy", "best_value": 0.550000011920929, "last_value": 0.550000011920929, "direction": "max", "history": [0.550000011920929, 0.5099999904632568, 0.49000000953674316, 0.550000011920929, 0.550000011920929], "statistics": {"min": 0.49000000953674316, "max": 0.550000011920929, "mean": 0.5300000071525574, "median": 0.550000011920929, "variance": 0.00064000020980842, "stddev": 0.025298225428049693}, "is_objective": true, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}, {"name": "val_loss", "best_value": 0.6994483923912048, "last_value": 0.6994483923912048, "direction": "min", "history": [0.7081533765792847, 0.7023491334915161, 0.6994483923912048, 0.6994483923912048, 0.6994483923912048], "statistics": {"min": 0.6994483923912048, "max": 0.7081533765792847, "mean": 0.701769537448883, "median": 0.6994483923912048, "variance": 1.1450495350367013e-05, "stddev": 0.003383858057065487}, "is_objective": false, "start_time": 1556848644.663765, "wall_time": [2.11867356300354, 3.268301010131836, 4.405857563018799, 4.4138383865356445, 4.4138383865356445]}]}, "hparams": {"layers:dims": {"name": "dims", "group": "layers", "type": "Range", "space_size": 8, "start": 16, "stop": 32, "values": [16, 18, 20, 22, 24, 26, 28, 30]}, "layers:activation": {"name": "activation", "group": "layers", "type": "Choice", "space_size": 2, "start": "relu", "stop": "tanh", "values": ["relu", "tanh"]}, "layers:extra_layer": {"name": "extra_layer", "group": "layers", "type": "Boolean", "space_size": 2, "start": true, "stop": false, "values": [true, false]}, "optimizer:loss": {"name": "loss", "group": "optimizer", "type": "Choice", "space_size": 2, "start": "binary_crossentropy", "stop": "mse", "values": ["binary_crossentropy", "mse"]}, "optimizer:lr": {"name": "lr", "group": "optimizer", "type": "Choice", "space_size": 3, "start": 0.01, "stop": 0.0001, "values": [0.01, 0.001, 0.0001]}}}