{"instance": {"objective": "val_accuracy", "validation_size": 100, "idx": "4c187b34628a4d98918122f7b9301cfa", "start_time": 1556841981, "loss_config": "binary_crossentropy", "hyper_parameters": {"optimizer:lr": {"group": "optimizer", "name": "lr", "value": 0.0001}, "optimizer:loss": {"group": "optimizer", "name": "loss", "value": "binary_crossentropy"}, "layers:extra_layer": {"group": "layers", "name": "extra_layer", "value": false}, "layers:activation": {"group": "layers", "name": "activation", "value": "relu"}, "layers:dims": {"group": "layers", "name": "dims", "value": 26}}, "training_size": 9900, "batch_size": 32, "is_best_model": true, "aggregate_metrics": [{"is_objective": false, "start_time": 1556841981.2905285, "wall_time": [2.7196457386016846, 5.198730945587158], "last_value": 0.49909090995788574, "name": "accuracy", "direction": "max", "best_value": 0.49909090995788574, "history": [0.49909090995788574, 0.49909090995788574], "statistics": {"max": 0.49909090995788574, "median": 0.49909090995788574, "stddev": 0.0, "min": 0.49909090995788574, "variance": 0.0, "mean": 0.49909090995788574}}, {"is_objective": false, "start_time": 1556841981.2905378, "wall_time": [2.7196438312530518, 5.1987292766571045], "last_value": 0.7024913061267197, "name": "loss", "direction": "min", "best_value": 0.7024913061267197, "history": [0.7024913061267197, 0.7024913061267197], "statistics": {"max": 0.7024913061267197, "median": 0.7024913061267197, "stddev": 0.0, "min": 0.7024913061267197, "variance": 0.0, "mean": 0.7024913061267197}}, {"is_objective": true, "start_time": 1556841981.2905352, "wall_time": [2.7196550369262695, 5.198740243911743], "last_value": 0.5699999928474426, "name": "val_accuracy", "direction": "max", "best_value": 0.5699999928474426, "history": [0.5699999928474426, 0.5699999928474426], "statistics": {"max": 0.5699999928474426, "median": 0.5699999928474426, "stddev": 0.0, "min": 0.5699999928474426, "variance": 0.0, "mean": 0.5699999928474426}}, {"is_objective": false, "start_time": 1556841981.29054, "wall_time": [2.7196221351623535, 5.1987433433532715], "last_value": 0.6853681087493897, "name": "val_loss", "direction": "min", "best_value": 0.6853681087493897, "history": [0.6853681087493897, 0.6853681087493897], "statistics": {"max": 0.6853681087493897, "median": 0.6853681087493897, "stddev": 0.0, "min": 0.6853681087493897, "variance": 0.0, "mean": 0.6853681087493897}}], "model_config": {"config": {"name": "sequential", "layers": [{"config": {"name": "dense", "activation": "linear", "activity_regularizer": null, "units": 26, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 200], "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_1", "activation": "relu", "activity_regularizer": null, "units": 26, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "sigmoid", "activity_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow"}, "executions": {"last_insert_idx": 1556841981, "execution_states": [{"record_time": 1556841986, "idx": 1556841981, "start_time": 1556841981, "max_epochs": 1, "eta": 5, "epochs": 1, "metrics": [{"is_objective": false, "start_time": 1556841981.2905285, "wall_time": [2.7196457386016846, 5.198730945587158], "last_value": 0.49909090995788574, "name": "accuracy", "direction": "max", "best_value": 0.49909090995788574, "history": [0.49909090995788574, 0.49909090995788574], "statistics": {"max": 0.49909090995788574, "median": 0.49909090995788574, "stddev": 0.0, "min": 0.49909090995788574, "variance": 0.0, "mean": 0.49909090995788574}}, {"is_objective": false, "start_time": 1556841981.2905378, "wall_time": [2.7196438312530518, 5.1987292766571045], "last_value": 0.7024913061267197, "name": "loss", "direction": "min", "best_value": 0.7024913061267197, "history": [0.7024913061267197, 0.7024913061267197], "statistics": {"max": 0.7024913061267197, "median": 0.7024913061267197, "stddev": 0.0, "min": 0.7024913061267197, "variance": 0.0, "mean": 0.7024913061267197}}, {"is_objective": true, "start_time": 1556841981.2905352, "wall_time": [2.7196550369262695, 5.198740243911743], "last_value": 0.5699999928474426, "name": "val_accuracy", "direction": "max", "best_value": 0.5699999928474426, "history": [0.5699999928474426, 0.5699999928474426], "statistics": {"max": 0.5699999928474426, "median": 0.5699999928474426, "stddev": 0.0, "min": 0.5699999928474426, "variance": 0.0, "mean": 0.5699999928474426}}, {"is_objective": false, "start_time": 1556841981.29054, "wall_time": [2.7196221351623535, 5.1987433433532715], "last_value": 0.6853681087493897, "name": "val_loss", "direction": "min", "best_value": 0.6853681087493897, "history": [0.6853681087493897, 0.6853681087493897], "statistics": {"max": 0.6853681087493897, "median": 0.6853681087493897, "stddev": 0.0, "min": 0.6853681087493897, "variance": 0.0, "mean": 0.6853681087493897}}]}]}, "optimizer_config": {"config": {"beta_2": 0.999, "epsilon": 1e-07, "learning_rate": 0.0001, "beta_1": 0.9, "name": "Adam", "amsgrad": false, "decay": 0.0}, "class_name": "Adam"}, "model_size": 5955}, "training_complete": true, "epoch_history": {}, "dynamic_hparams": false, "tuner": {"keras_function": "fit", "start_time": 1556841970, "debug": false, "user_info": {}, "metrics": {}, "project": "default", "name": "RandomSearch", "max_model_parameters": 25000000, "eta": 0, "best_instance": {"objective": "val_accuracy", "validation_size": 100, "idx": "4c187b34628a4d98918122f7b9301cfa", "start_time": 1556841981, "loss_config": "binary_crossentropy", "hyper_parameters": {"optimizer:lr": {"group": "optimizer", "name": "lr", "value": 0.0001}, "optimizer:loss": {"group": "optimizer", "name": "loss", "value": "binary_crossentropy"}, "layers:extra_layer": {"group": "layers", "name": "extra_layer", "value": false}, "layers:activation": {"group": "layers", "name": "activation", "value": "relu"}, "layers:dims": {"group": "layers", "name": "dims", "value": 26}}, "training_size": 9900, "batch_size": 32, "is_best_model": true, "aggregate_metrics": [{"is_objective": false, "start_time": 1556841981.2905285, "wall_time": [2.7196457386016846, 5.198730945587158], "last_value": 0.49909090995788574, "name": "accuracy", "direction": "max", "best_value": 0.49909090995788574, "history": [0.49909090995788574, 0.49909090995788574], "statistics": {"max": 0.49909090995788574, "median": 0.49909090995788574, "stddev": 0.0, "min": 0.49909090995788574, "variance": 0.0, "mean": 0.49909090995788574}}, {"is_objective": false, "start_time": 1556841981.2905378, "wall_time": [2.7196438312530518, 5.1987292766571045], "last_value": 0.7024913061267197, "name": "loss", "direction": "min", "best_value": 0.7024913061267197, "history": [0.7024913061267197, 0.7024913061267197], "statistics": {"max": 0.7024913061267197, "median": 0.7024913061267197, "stddev": 0.0, "min": 0.7024913061267197, "variance": 0.0, "mean": 0.7024913061267197}}, {"is_objective": true, "start_time": 1556841981.2905352, "wall_time": [2.7196550369262695, 5.198740243911743], "last_value": 0.5699999928474426, "name": "val_accuracy", "direction": "max", "best_value": 0.5699999928474426, "history": [0.5699999928474426, 0.5699999928474426], "statistics": {"max": 0.5699999928474426, "median": 0.5699999928474426, "stddev": 0.0, "min": 0.5699999928474426, "variance": 0.0, "mean": 0.5699999928474426}}, {"is_objective": false, "start_time": 1556841981.29054, "wall_time": [2.7196221351623535, 5.1987433433532715], "last_value": 0.6853681087493897, "name": "val_loss", "direction": "min", "best_value": 0.6853681087493897, "history": [0.6853681087493897, 0.6853681087493897], "statistics": {"max": 0.6853681087493897, "median": 0.6853681087493897, "stddev": 0.0, "min": 0.6853681087493897, "variance": 0.0, "mean": 0.6853681087493897}}], "model_config": {"config": {"name": "sequential", "layers": [{"config": {"name": "dense", "activation": "linear", "activity_regularizer": null, "units": 26, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 200], "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_1", "activation": "relu", "activity_regularizer": null, "units": 26, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "sigmoid", "activity_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow"}, "executions": {"last_insert_idx": null, "execution_states": []}, "optimizer_config": {"config": {"beta_2": 0.999, "epsilon": 1e-07, "learning_rate": 0.0001, "beta_1": 0.9, "name": "Adam", "amsgrad": false, "decay": 0.0}, "class_name": "Adam"}, "model_size": 5955}, "remaining_budget": 0, "dry_run": false, "objective": "val_accuracy", "checkpoint": true, "min_epochs": 3, "max_epochs": 1, "num_executions": 1, "epoch_budget": 2, "display_model": false, "stats": {"num_over_sized_models": 0, "num_generated_models": 2, "num_invalid_models": 0, "num_mdl_previously_trained": 0, "num_collision": 0}, "aggregate_metrics": [{"is_objective": false, "start_time": 1556841971.7770383, "wall_time": [6.041154384613037, 9.289895296096802, 9.289925575256348, 14.712257385253906], "last_value": 0.49909090995788574, "name": "accuracy", "direction": "max", "best_value": 0.49909090995788574, "history": [0.49646463990211487, 0.49646463990211487, 0.49646463990211487, 0.49909090995788574], "statistics": {"max": 0.49909090995788574, "median": 0.49646463990211487, "stddev": 0.0011372082927479756, "min": 0.49646463990211487, "variance": 1.2932427010947656e-06, "mean": 0.4971212074160576}}, {"is_objective": false, "start_time": 1556841971.777048, "wall_time": [6.041155576705933, 9.289892435073853, 9.289920330047607, 14.712254285812378], "last_value": 0.7024913061267197, "name": "loss", "direction": "min", "best_value": 0.7024913061267197, "history": [0.711365469320856, 0.711365469320856, 0.711365469320856, 0.7024913061267197], "statistics": {"max": 0.711365469320856, "median": 0.711365469320856, "stddev": 0.003842625381725426, "min": 0.7024913061267197, "variance": 1.4765769824280477e-05, "mean": 0.709146928522322}}, {"is_objective": true, "start_time": 1556841971.7770452, "wall_time": [6.0411696434021, 9.289902448654175, 9.28992772102356, 14.712264060974121], "last_value": 0.5699999928474426, "name": "val_accuracy", "direction": "max", "best_value": 0.5699999928474426, "history": [0.49000000953674316, 0.49000000953674316, 0.49000000953674316, 0.5699999928474426], "statistics": {"max": 0.5699999928474426, "median": 0.49000000953674316, "stddev": 0.03464100892469843, "min": 0.49000000953674316, "variance": 0.0011999994993210361, "mean": 0.510000005364418}}, {"is_objective": false, "start_time": 1556841971.7770503, "wall_time": [6.041126489639282, 9.289903163909912, 9.289926767349243, 14.712266683578491], "last_value": 0.6853681087493897, "name": "val_loss", "direction": "min", "best_value": 0.6853681087493897, "history": [0.7035594010353088, 0.7035594010353088, 0.7035594010353088, 0.6853681087493897], "statistics": {"max": 0.7035594010353088, "median": 0.7035594010353088, "stddev": 0.007877060623636913, "min": 0.6853681087493897, "variance": 6.204808406845115e-05, "mean": 0.6990115779638291}}], "host": {"ram": {"total": 192117, "used": 15855, "unit": "MB"}, "software": {"tensorflow": "2.0.0-dev20190424", "tensorflow_use_gpu": true, "python": "3.5.4rc1", "gpu_driver": "410.48", "kerastuner": "0.8.2", "os": {"name": "Linux", "version": "#1 SMP Debian 4.19.28-2rodete1 (2019-03-18 > 2018)"}}, "available_gpu": 1, "hostname": "jamlong3.svl.corp.google.com", "export_dir": "export/", "cpu": {"frequency": {"max": 3700.0, "current": 1201.1667500000003, "unit": "MHZ"}, "name": "", "core_count": 72, "usage": 1.2}, "tmp_dir": "tmp/", "result_dir": "results/", "uptime": 710419, "disk": [{"name": "/", "total": 728, "used": 116, "unit": "GB"}, {"name": "/boot", "total": 1, "used": 0, "unit": "GB"}, {"name": "/boot/efi", "total": 1, "used": 0, "unit": "GB"}], "gpu": [{"uuid": "GPU-0502d27c-c0dc-acd7-68ef-f9fb11a8b52c", "index": "0", "memory": {"total": 10986, "used": 10676, "unit": "MB"}, "name": "GeForce RTX 2080 Ti", "usage": "0", "temperature": {"value": 54, "unit": "C"}}]}, "architecture": "default"}, "update_time": 1556841986, "execution": {"record_time": 1556841986, "idx": 1556841981, "start_time": 1556841981, "max_epochs": 1, "eta": 5, "epochs": 1, "metrics": [{"is_objective": false, "start_time": 1556841981.2905285, "wall_time": [2.7196457386016846, 5.198730945587158], "last_value": 0.49909090995788574, "name": "accuracy", "direction": "max", "best_value": 0.49909090995788574, "history": [0.49909090995788574, 0.49909090995788574], "statistics": {"max": 0.49909090995788574, "median": 0.49909090995788574, "stddev": 0.0, "min": 0.49909090995788574, "variance": 0.0, "mean": 0.49909090995788574}}, {"is_objective": false, "start_time": 1556841981.2905378, "wall_time": [2.7196438312530518, 5.1987292766571045], "last_value": 0.7024913061267197, "name": "loss", "direction": "min", "best_value": 0.7024913061267197, "history": [0.7024913061267197, 0.7024913061267197], "statistics": {"max": 0.7024913061267197, "median": 0.7024913061267197, "stddev": 0.0, "min": 0.7024913061267197, "variance": 0.0, "mean": 0.7024913061267197}}, {"is_objective": true, "start_time": 1556841981.2905352, "wall_time": [2.7196550369262695, 5.198740243911743], "last_value": 0.5699999928474426, "name": "val_accuracy", "direction": "max", "best_value": 0.5699999928474426, "history": [0.5699999928474426, 0.5699999928474426], "statistics": {"max": 0.5699999928474426, "median": 0.5699999928474426, "stddev": 0.0, "min": 0.5699999928474426, "variance": 0.0, "mean": 0.5699999928474426}}, {"is_objective": false, "start_time": 1556841981.29054, "wall_time": [2.7196221351623535, 5.1987433433532715], "last_value": 0.6853681087493897, "name": "val_loss", "direction": "min", "best_value": 0.6853681087493897, "history": [0.6853681087493897, 0.6853681087493897], "statistics": {"max": 0.6853681087493897, "median": 0.6853681087493897, "stddev": 0.0, "min": 0.6853681087493897, "variance": 0.0, "mean": 0.6853681087493897}}]}, "hparams": {"optimizer:lr": {"start": 0.01, "type": "Choice", "space_size": 3, "group": "optimizer", "name": "lr", "values": [0.01, 0.001, 0.0001], "stop": 0.0001}, "optimizer:loss": {"start": "binary_crossentropy", "type": "Choice", "space_size": 2, "group": "optimizer", "name": "loss", "values": ["binary_crossentropy", "mse"], "stop": "mse"}, "layers:extra_layer": {"start": true, "type": "Boolean", "space_size": 2, "group": "layers", "name": "extra_layer", "values": [true, false], "stop": false}, "layers:activation": {"start": "relu", "type": "Choice", "space_size": 2, "group": "layers", "name": "activation", "values": ["relu", "tanh"], "stop": "tanh"}, "layers:dims": {"start": 16, "type": "Range", "space_size": 8, "group": "layers", "name": "dims", "values": [16, 18, 20, 22, 24, 26, 28, 30], "stop": 32}}}